import Image from "next/image";
import globalInformationImg from "../../../../../../public/GlobalInformationImg.png";
import ic6 from "../../../../../../public/ic6.png";
import Breadcrumb from "@/components/Breadcrumb";
import { FaXTwitter } from "react-icons/fa6";
function NewsDetails() {
    const breadcrumbData = [
        { title: "الرئيسية", link: "/" },
        { title: "المركز الاعلامي", link: "/ar/MediaCenter" },
        { title: "الأخبار", link: "/ar/MediaCenter/news" },
        { title: "تفاصيل الخبر", link: "/ar/MediaCenter/news/newsDetails" },
    ];
    const unsafeHtml = `هو اضطراب مزمن في الجهاز الهضمي يضر بالأمعاء الدقيقة والذي يسبب استجابة الجهاز المناعي بشكل غير طبيعي لبروتين "الغلوتين" (هو بروتين موجود بشكل طبيعي في القمح والشعير، وهو شائع في الخبز والمعكرونة والبسكويت والكعك)؛ مما يؤدي إلى تلف بطانة الأمعاء الدقيقة، تحتوي العديد من المنتجات على الغلوتين (مثل: الأطعمة المعبأة، ومرطبات الشفاه، وأحمر الشفاه، ومعاجين الأسنان، والفيتامينات، والمكملات الغذائية، ويكون في الأدوية بكمية نادرة).
  <strong>السبب:</strong>
  في الأمعاء الدقيقة يُمتَصُّ الطعام والعناصر الغذائية، أما في حالة السيلياك فيمكن أن يؤدي تلف بطانة الأمعاء الدقيقة إلى صعوبة امتصاص العناصر الغذائية "سوء الامتصاص"، وغير معروف حتى الآن سبب الإصابة به، لكن  قد تلعب كل من العوامل البيئية والوراثية دورًا في الإصابة به.
  
  <strong>الأعراض:</strong>
  تختلف الأعراض من شخص لآخر، حيث يعاني بعض الأشخاص المصابين من:
  آلام في البطن.
  الإسهال المزمن.
  الشعور بحركة في الأمعاء غير مريحة.
  فقدان الوزن.
  الشعور بالانتفاخ أو الامتلاء طوال الوقت.
  قلة الشهية.
  تختلف الأعراض في الأطفال، حيث إن عدم قدرتهم على امتصاص العناصر الغذائية في وقت مهم جدًّا للنمو الطبيعي والتطور يمكن أن يؤدي إلى:
  تلف مينا الأسنان الدائمة.
  تأخر البلوغ.
  فشل في النمو (وزن الرضيع أو الطفل أقل أو يكتسب وزنًا أقل مما هو متوقع).
  تغير المزاج أو الشعور بالضيق.
  بطء النمو وقِصَر الطول.
  فقدان الوزن.
  يعاني بعض المصابين بالسيلياك من أعراض تؤثر على أجزاء أخرى من الجسم مثل:
  التهاب الجلد: حيث يظهر في صورة طفح جلدي شديد الحكة وبه تقرحات على المرفقين أو الركبتين أو الأرداف أو الظهر أو فروة الرأس.
  الشعور بالإجهاد أو التعب.
  آلام المفاصل أو العظام.
  مشاكل نفسية مثل الاكتئاب أو القلق.
  مشاكل عصبية (مثل الصداع، أو مشاكل التوازن، أو النوبات، أو اعتلال الأعصاب الطرفية).
  مشاكل الإنجاب لدى الإناث والتي قد تشمل العقم، وتأخر بدء فترات الحيض، أو الإجهاض المتكرر.
  تقرحات أو جفاف الفم.
  
  <strong>  المضاعفات:</strong>
  إصابة الأمعاء الدقيقة بتقرحات متعددة لا تلتئم.
  سرطان الغدد الليمفاوية.
  الأمراض الجلدية.
  
  العلاج:
  إن العلاج الأساسي هو اتباع نظام غذائي خالٍ من الغلوتين مدى الحياة، لأن الكميات الصغيرة منه يمكن أن تؤدي إلى تفاقم المرض، لذا يجب استشارة اختصاصي التغذية للمساعدة على تعلم كيفية تناول نظام غذائي خالٍ من الغلوتين، والأطعمة التي يجب تجنبها، والأطعمة التي يجب إضافتها للحصول على نظام غذائي متوازن من الناحية الغذائية.
  إرشادات للمصابين بمرض السيلياك:
  تجنب الأطعمة التي تحتوي على القمح والشعير والشوفان.
  الانتباه للملصقات الغذائية التي تحتوي على عبارة "خالٍ من الغلوتين".
  اختيار الأطعمة الخالية من الغلوتين بشكل طبيعي (مثل: الأرز، والذرة، والبطاطس، والحبوب، واللحوم، والأسماك، والفواكه، والخضروات بدون إضافات أو بعض التوابل).
  اختيار المكسرات والبذور الخالية من الغلوتين خاصة المحمصة.
  اختيار منتجات الألبان التي تحتوي على نسبة قليلة من اللاكتوز أو الخالية من اللاكتوز.
  اختيار بدائل خالية من الغلوتين وخالية من منتجات الألبان (مثل: فول الصويا أو الجوز الغنية بالكالسيوم والفيتامينات).
  معرفة الأطعمة والأدوية والمكملات ومنتجات العناية بالفم التي تحتوي على الغلوتين والبدائل المتاحة.
  عند تناول الطعام في الخارج يمكن تقديم قائمة خالية من الغلوتين أو بدائل للمكونات.
  تجنب تناول الأطعمة عند عدم التأكد مما إذا كانت تحتوي أو لا تحتوي على الغلوتين.
  تخزين وإعداد الأطعمة الخالية من الغلوتين بشكل منفصل عن أطعمة أفراد الأسرة الأخرى التي تحتوي على الغلوتين.
  في المناسبات الاجتماعية يفضَّل إحضار الأطعمة الخالية من الغلوتين لتناولها بشكل آمن.
  `;
    return (
        <div className="container my-10">
            <Breadcrumb items={breadcrumbData} />
            <div className="w-[100%] flex flex-col gap-3 text-start">
                <p className="font-extrabold text-[#001F15]  lg:text-[24px]  sm:text-[16px]  md:text-[20px]">حمـلة توعـوية بالتعاون مع مستشفي الامام عبد الرحمن الفيصل</p>
                <div className=" flex justify-start items-center gap-2">
                    <Image alt='icon' src={ic6} />
                    <p>2 طبيب</p>
                    <Image alt='icon' src={ic6} />
                    <p>60 دقيقة</p>
                </div>
                <Image src={globalInformationImg} alt="globalInformationImg" className="w-[100%]" />

                <div dangerouslySetInnerHTML={{ __html: unsafeHtml }} className="flex flex-col gap-2 my-3" />
                <p className="text-[#001F15] flex items-center gap-2 text-[16px] font-[600]">
                    رابط الخبر على منصة <FaXTwitter size={25} color="#001F15" /></p>
                <p className="text-[#001F15] text-[14px] font-[500]">الحملة التوعوية فى مستشفي الملك سلمان </p>
                <p className="text-[#001F15] text-[12px] font-[400]">12 نوفمبر, 2023 </p>

            </div>
        </div>
    )
}

export default NewsDetails;
